simulations/hydropower/openfoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          64;
        startFace       135951;
    }
    bottom_wall
    {
        type            patch;
        nFaces          2832;
        startFace       136015;
    }
    top_wall
    {
        type            patch;
        nFaces          2632;
        startFace       138847;
    }
    side_wall
    {
        type            patch;
        nFaces          11706;
        startFace       141479;
    }
)

// ************************************************************************* //
